# 피벗 테이블

In [3]:
import pandas as pd
import numpy as np

In [6]:
data = {
    '도시':['서울', '서울', '서울', '부산', '부산', '부산', '인천', '인천'],
    '연도':['2015', '2010','2005','2015','2010','2005','2015','2010'],
    '인구':[99393938, 99393938,  99393938, 99393938, 99393938, 99393938, 99393938, 99393938],
    '지역':['수도권', '수도권', '수도권', '경상권', '경상권', '경상권', '수도권', '수도권']
}

df = pd.DataFrame(data)

## 도시별 연도별 인구수

In [7]:
df.pivot('도시', '연도', '인구')

연도        2005        2010        2015
도시
부산  99393938.0  99393938.0  99393938.0
서울  99393938.0  99393938.0  99393938.0
인천         NaN  99393938.0  99393938.0

In [8]:
df.pivot_table('인구', '도시', '연도')

연도        2005        2010        2015
도시
부산  99393938.0  99393938.0  99393938.0
서울  99393938.0  99393938.0  99393938.0
인천         NaN  99393938.0  99393938.0

In [9]:
df.pivot_table('인구', '도시', '연도', margins_name = '평균', margins = True)

연도        2005        2010        2015        평균
도시
부산  99393938.0  99393938.0  99393938.0  99393938
서울  99393938.0  99393938.0  99393938.0  99393938
인천         NaN  99393938.0  99393938.0  99393938
평균  99393938.0  99393938.0  99393938.0  99393938

In [13]:
df.pivot_table('인구', '도시', '연도', aggfunc = 'sum', margins_name = '총합', margins = True)

연도         2005         2010         2015         총합
도시
부산   99393938.0   99393938.0   99393938.0  298181814
서울   99393938.0   99393938.0   99393938.0  298181814
인천          NaN   99393938.0   99393938.0  198787876
총합  198787876.0  298181814.0  298181814.0  795151504